Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
/* Definitions for QuequeBattery */
osMessageQueueId_t QuequeBatteryHandle;
const osMessageQueueAttr_t QuequeBattery_attributes = {
  .name = "QuequeBattery"
};
/* Definitions for QuequePV */
osMessageQueueId_t QuequePVHandle;
const osMessageQueueAttr_t QuequePV_attributes = {
  .name = "QuequePV"
};
/* Definitions for TimerBmeData */
osTimerId_t TimerBmeDataHandle;
const osTimerAttr_t TimerBmeData_attributes = {
  .name = "TimerBmeData"
};
/* Definitions for TimerBh1750Data */
osTimerId_t TimerBh1750DataHandle;
const osTimerAttr_t TimerBh1750Data_attributes = {
  .name = "TimerBh1750Data"
};
/* Definitions for TimerRTC */
osTimerId_t TimerRTCHandle;
const osTimerAttr_t TimerRTC_attributes = {
  .name = "TimerRTC"
};
/* Definitions for TimerSDCard */
osTimerId_t TimerSDCardHandle;
const osTimerAttr_t TimerSDCard_attributes = {
  .name = "TimerSDCard"
};
/* Definitions for TimerINA219 */
osTimerId_t TimerINA219Handle;
const osTimerAttr_t TimerINA219_attributes = {
  .name = "TimerINA219"
};
/* Definitions for MutexPrintf */
osMutexId_t MutexPrintfHandle;
const osMutexAttr_t MutexPrintf_attributes = {
  .name = "MutexPrintf"
};
/* Definitions for MutexI2C */
osMutexId_t MutexI2CHandle;
const osMutexAttr_t MutexI2C_attributes = {
  .name = "MutexI2C"
};
/* Definitions for MutexRTC */
osMutexId_t MutexRTCHandle;
const osMutexAttr_t MutexRTC_attributes = {
  .name = "MutexRTC"
};
/* Definitions for MutexAlarm */
osMutexId_t MutexAlarmHandle;
const osMutexAttr_t MutexAlarm_attributes = {
  .name = "MutexAlarm"
};
/* Definitions for MutexI2C2 */
osMutexId_t MutexI2C2Handle;
const osMutexAttr_t MutexI2C2_attributes = {
  .name = "MutexI2C2"
};
/* Definitions for MutexSdCard */
osMutexId_t MutexSdCardHandle;
const osMutexAttr_t MutexSdCard_attributes = {
  .name = "MutexSdCard"
};
/* Definitions for BinarySemBme280 */
osSemaphoreId_t BinarySemBme280Handle;
const osSemaphoreAttr_t BinarySemBme280_attributes = {
  .name = "BinarySemBme280"
};
/* Definitions for BinarySemBH1750 */
osSemaphoreId_t BinarySemBH1750Handle;
const osSemaphoreAttr_t BinarySemBH1750_attributes = {
  .name = "BinarySemBH1750"
};
/* Definitions for BinarySemRTC */
osSemaphoreId_t BinarySemRTCHandle;
const osSemaphoreAttr_t BinarySemRTC_attributes = {
  .name = "BinarySemRTC"
};
/* Definitions for BinarySemCounter */
osSemaphoreId_t BinarySemCounterHandle;
const osSemaphoreAttr_t BinarySemCounter_attributes = {
  .name = "BinarySemCounter"
};
/* Definitions for BinarySemSetAlarm */
osSemaphoreId_t BinarySemSetAlarmHandle;
const osSemaphoreAttr_t BinarySemSetAlarm_attributes = {
  .name = "BinarySemSetAlarm"
};
/* Definitions for BinarySdCard */
osSemaphoreId_t BinarySdCardHandle;
const osSemaphoreAttr_t BinarySdCard_attributes = {
  .name = "BinarySdCard"
};
/* Definitions for BinarySemINA219 */
osSemaphoreId_t BinarySemINA219Handle;
const osSemaphoreAttr_t BinarySemINA219_attributes = {
  .name = "BinarySemINA219"
};

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN FunctionPrototypes */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin);
void _putchar(char character);
/* USER CODE END FunctionPrototypes */

void StartTaskRTC(void *argument);
void StartTaskBme280(void *argument);
void StartTaskBH1750(void *argument);
void StartTaskSSD1306(void *argument);
void StartTaskPumpON(void *argument);
void StartTaskPumpOFF(void *argument);
void StartTaskCounterPump(void *argument);
void StartTaskAlarmCounter(void *argument);
void StartTaskSdCard(void *argument);
void StartTaskINA219(void *argument);
void CallbackTimerBmeData(void *argument);
void CallbackTimerBh1750Data(void *argument);
void CallbackTimerRTC(void *argument);
void CallbackTimerSDCard(void *argument);
void CallbackTimerINA219(void *argument);

void MX_FREERTOS_Init(void); /* (MISRA C 2004 rule 8.1) */

/**
  * @brief  FreeRTOS initialization
  * @param  None
  * @retval None
  */
void MX_FREERTOS_Init(void) {
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */
  /* Create the mutex(es) */
  /* creation of MutexPrintf */
  MutexPrintfHandle = osMutexNew(&MutexPrintf_attributes);

  /* creation of MutexI2C */
  MutexI2CHandle = osMutexNew(&MutexI2C_attributes);

  /* creation of MutexRTC */
  MutexRTCHandle = osMutexNew(&MutexRTC_attributes);

  /* creation of MutexAlarm */
  MutexAlarmHandle = osMutexNew(&MutexAlarm_attributes);

  /* creation of MutexI2C2 */
  MutexI2C2Handle = osMutexNew(&MutexI2C2_attributes);

  /* creation of MutexSdCard */
  MutexSdCardHandle = osMutexNew(&MutexSdCard_attributes);

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* Create the semaphores(s) */
  /* creation of BinarySemBme280 */
  BinarySemBme280Handle = osSemaphoreNew(1, 1, &BinarySemBme280_attributes);

  /* creation of BinarySemBH1750 */
  BinarySemBH1750Handle = osSemaphoreNew(1, 1, &BinarySemBH1750_attributes);

  /* creation of BinarySemRTC */
  BinarySemRTCHandle = osSemaphoreNew(1, 1, &BinarySemRTC_attributes);

  /* creation of BinarySemCounter */
  BinarySemCounterHandle = osSemaphoreNew(1, 1, &BinarySemCounter_attributes);

  /* creation of BinarySemSetAlarm */
  BinarySemSetAlarmHandle = osSemaphoreNew(1, 1, &BinarySemSetAlarm_attributes);

  /* creation of BinarySdCard */
  BinarySdCardHandle = osSemaphoreNew(1, 1, &BinarySdCard_attributes);

  /* creation of BinarySemINA219 */
  BinarySemINA219Handle = osSemaphoreNew(1, 1, &BinarySemINA219_attributes);

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* Create the timer(s) */
  /* creation of TimerBmeData */
  TimerBmeDataHandle = osTimerNew(CallbackTimerBmeData, osTimerPeriodic, NULL, &TimerBmeData_attributes);

  /* creation of TimerBh1750Data */
  TimerBh1750DataHandle = osTimerNew(CallbackTimerBh1750Data, osTimerPeriodic, NULL, &TimerBh1750Data_attributes);

  /* creation of TimerRTC */
  TimerRTCHandle = osTimerNew(CallbackTimerRTC, osTimerPeriodic, NULL, &TimerRTC_attributes);

  /* creation of TimerSDCard */
  TimerSDCardHandle = osTimerNew(CallbackTimerSDCard, osTimerPeriodic, NULL, &TimerSDCard_attributes);

