Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
  /* creation of TimerINA219 */
  TimerINA219Handle = osTimerNew(CallbackTimerINA219, osTimerPeriodic, NULL, &TimerINA219_attributes);

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the queue(s) */
  /* creation of QueueBme */
  QueueBmeHandle = osMessageQueueNew (5, sizeof(BmeData_t), &QueueBme_attributes);

  /* creation of QueueBh1750 */
  QueueBh1750Handle = osMessageQueueNew (5, sizeof(BHData_t), &QueueBh1750_attributes);

  /* creation of QueueRTCData */
  QueueRTCDataHandle = osMessageQueueNew (5, sizeof(RTC_DateTypeDef), &QueueRTCData_attributes);

  /* creation of QueueRTCTime */
  QueueRTCTimeHandle = osMessageQueueNew (5, sizeof(RTC_TimeTypeDef), &QueueRTCTime_attributes);

  /* creation of QueueCounterPump */
  QueueCounterPumpHandle = osMessageQueueNew (1, sizeof(uint8_t), &QueueCounterPump_attributes);

  /* creation of QueueCounterAlarm */
  QueueCounterAlarmHandle = osMessageQueueNew (1, sizeof(uint8_t), &QueueCounterAlarm_attributes);

  /* creation of QueSDCARD */
  QueSDCARDHandle = osMessageQueueNew (1, sizeof(Data_Structure_t), &QueSDCARD_attributes);

  /* creation of QuequeBattery */
  QuequeBatteryHandle = osMessageQueueNew (16, sizeof(INA219Data_t), &QuequeBattery_attributes);

  /* creation of QuequePV */
  QuequePVHandle = osMessageQueueNew (16, sizeof(INA219Data_t), &QuequePV_attributes);

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* creation of TaskRTC */
  TaskRTCHandle = osThreadNew(StartTaskRTC, NULL, &TaskRTC_attributes);

  /* creation of TaskBme280 */
  TaskBme280Handle = osThreadNew(StartTaskBme280, NULL, &TaskBme280_attributes);

  /* creation of TaskBH1750 */
  TaskBH1750Handle = osThreadNew(StartTaskBH1750, NULL, &TaskBH1750_attributes);

  /* creation of TaskSSD1306 */
  TaskSSD1306Handle = osThreadNew(StartTaskSSD1306, NULL, &TaskSSD1306_attributes);

  /* creation of TaskPumpON */
  TaskPumpONHandle = osThreadNew(StartTaskPumpON, NULL, &TaskPumpON_attributes);

  /* creation of TaskPumpOFF */
  TaskPumpOFFHandle = osThreadNew(StartTaskPumpOFF, NULL, &TaskPumpOFF_attributes);

  /* creation of TaskCounterPump */
  TaskCounterPumpHandle = osThreadNew(StartTaskCounterPump, NULL, &TaskCounterPump_attributes);

  /* creation of TaskAlarmCounte */
  TaskAlarmCounteHandle = osThreadNew(StartTaskAlarmCounter, NULL, &TaskAlarmCounte_attributes);

  /* creation of TaskSdCard */
  TaskSdCardHandle = osThreadNew(StartTaskSdCard, NULL, &TaskSdCard_attributes);

  /* creation of TaskINA219 */
  TaskINA219Handle = osThreadNew(StartTaskINA219, NULL, &TaskINA219_attributes);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_EVENTS */
  /* add events, ... */
  /* USER CODE END RTOS_EVENTS */

}

/* USER CODE BEGIN Header_StartTaskRTC */
/**
  * @brief  Function implementing the TaskRTC thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartTaskRTC */
void StartTaskRTC(void *argument)
{
  /* USER CODE BEGIN StartTaskRTC */
	extern RTC_HandleTypeDef hrtc;
	 	 RTC_TimeTypeDef _RTCTime;
	 	 RTC_DateTypeDef _RTCDate;
	 	 RTC_AlarmTypeDef _AlarmON, _AlarmOFF;


	 	static uint8_t _PumpDispensing = 1;
	 	static uint8_t _AlarmPeriod = 1;
	 	uint8_t SdCard = 1;






	 	 _AlarmON.AlarmTime.Hours = 8 ;
	 	 _AlarmON.AlarmTime.Minutes = 0 ;
	 	_AlarmON.AlarmTime.Seconds = 0 ;


		 _AlarmOFF.AlarmTime.Hours = 8 ;
		 _AlarmOFF.AlarmTime.Minutes = 1 ;
		_AlarmOFF.AlarmTime.Seconds = 0 ;




	 	HAL_RTC_Init(&hrtc);
		HAL_RTC_GetDate(&hrtc, &_RTCDate, RTC_FORMAT_BIN);
		HAL_RTC_GetTime(&hrtc, &_RTCTime, RTC_FORMAT_BIN);

		HAL_RTC_SetAlarm(&hrtc, &_AlarmON, RTC_FORMAT_BIN);
		HAL_RTC_SetAlarm(&hrtc, &_AlarmOFF, RTC_FORMAT_BIN);

	// 	_RTCTime.Hours = 0x0;
	//    _RTCTime.Minutes =0x0;
	//	_RTCTime.Seconds =0x0;
	// 	HAL_RTC_SetDate(&hrtc, &_RTCDate, RTC_FORMAT_BIN);
	// 	HAL_RTC_SetTime(&hrtc, &_RTCTime, RTC_FORMAT_BIN);

		osMessageQueuePut(QueueCounterAlarmHandle, &_AlarmPeriod, 0, osWaitForever);
		osMessageQueuePut(QueueCounterPumpHandle, &_PumpDispensing, 0, osWaitForever);
	 	osTimerStart(TimerRTCHandle, 100);
	 	uint32_t tick4 = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  //	  osMessageQueuePut(QueueCounterPumpHandle, &_PumpOperatingTime, 0, 10);
	  //	  osMessageQueuePut(QueueAlarmHandle, &_AlarmPeriod, 0, 10);
	  printf("Task RTC start \n\r ");
	  	  HAL_RTC_GetDate(&hrtc, &_RTCDate, RTC_FORMAT_BIN);
	  	  HAL_RTC_GetTime(&hrtc, &_RTCTime, RTC_FORMAT_BIN);

	  	if (osOK == osSemaphoreAcquire(BinarySemCounterHandle, 0))
	  	{
	  		osMessageQueueGet(QueueCounterPumpHandle, &_PumpDispensing, 0, osWaitForever);
	  		_AlarmOFF.AlarmTime.Minutes = _PumpDispensing;

	  	}
	  	else if (osOK == osSemaphoreAcquire(BinarySemSetAlarmHandle, 0))
	  	{
	  		osMessageQueueGet(QueueCounterAlarmHandle, &_AlarmPeriod, 0, osWaitForever);
//	  			  		_AlarmOFF.AlarmTime.Minutes = _AlarmPeriod;
	  	}


	  ////	  osMessageQueueGet(QueueAlarmHandle, &_AlarmPeriod, 0, 10);
	  //	  if(osOK == osSemaphoreAcquire(BinarySemSetAlarmHandle, 0))
	  //		{
	  //
	  //		  	  osMessageQueueGet(QueueAlarmHandle, &_AlarmPeriod, 0, 100);
	  //		  	  osMessageQueueGet(QueueCounterPumpHandle, &_PumpOperatingTime, 0, 100);
	  //			  _AlarmOFF.AlarmTime.Minutes = _PumpOperatingTime.Minutes;
	  //			  HAL_RTC_SetAlarm(&hrtc, &_AlarmOFF, RTC_FORMAT_BIN);
	  //		}



	  	   if (_AlarmON.AlarmTime.Hours ==  _RTCTime.Hours && _AlarmON.AlarmTime.Minutes ==  _RTCTime.Minutes )
	  	  	  {
	  		  osMutexAcquire(MutexAlarmHandle, osWaitForever);
	  			  HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin,GPIO_PIN_SET);
	  			  osThreadFlagsSet(TaskPumpONHandle, 0x00000001U);
	  			  _AlarmON.AlarmTime.Hours = _AlarmON.AlarmTime.Hours + _AlarmPeriod;

