Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
	  		   osMessageQueuePut(QueueCounterAlarmHandle, &_AlarmPeriod, 0, osWaitForever);
	  		   osSemaphoreRelease(BinarySemSetAlarmHandle);

	  	 }
//	  	   osMessageQueueGet(QueueCounterAlarmHandle, &_AlarmPeriod, 0, 50);


//	  	   osMessageQueuePut(QueueCounterPumpHandle, &_PumpOperatingTime, 0, osWaitForever);
	  	  sprintf(PointerData->MessageData, "Data: %02d:%02d:%02d;",_RTCData.Date,_RTCData.Month,_RTCData.Year);
	      sprintf(PointerData->MessageTime, "Time: %02d:%02d:%02d;",_RTCTime.Hours,_RTCTime.Minutes,_RTCTime.Seconds);
	  	  sprintf(PointerData->MessageTemp, "Temperature: %.2f; ", _BmeData.Temperature);
	  	  sprintf(PointerData->MessageHum, "Humidity: %.2f;", _BmeData.Humidity);
	  	  sprintf(PointerData->MessageInten, "Lx: %.2f;", _BHData.LightIntensity);
	  	  sprintf(PointerData->MessagePvVoltageBus,"Battery Voltage bus: %u;",_INA219_Battery.VoltageBus);
	  	  sprintf(PointerData->MessagePVVoltageShunt,"Battery Voltage shunt: %u;",_INA219_Battery.VoltageShunt);
	  	  sprintf(PointerData->MessagePVCurrent,"Current: %d;",_INA219_Battery.Current);
	  //  sprintf(MessageData, "Data: %02d.%02d.20%02d  Time: %02d:%02d:%02d:%02d",_RTCDate.Date,_RTCDate.Month,_RTCDate.Year,_RTCTime.Hours,_RTCTime.Minutes,_RTCTime.Seconds);


	  	  sprintf(PointerData->MessageTimePump, "Pump OP Time: %02d Min;",_PumpDispensing);
	  	  sprintf(PointerData->MessageFreqAlarm, "Alarm Period: %02d H;", _AlarmPeriod);

	  	if (osOK == osSemaphoreAcquire(BinarySdCardHandle, 0)) {
	  		  	  			osMessageQueuePut(QueSDCARDHandle,PointerData, 0, 50);
	  		  	  		}




	  	  GFX_DrawString(0, 0, PointerData->MessageTime, WHITE, 0);
	  	  GFX_DrawString(0, 10, PointerData->MessageTemp, WHITE, 0);
	  	  GFX_DrawString(0, 20, PointerData->MessageHum, WHITE, 0);
	  	  GFX_DrawString(0, 30, PointerData->MessageInten, WHITE, 0);
	  	  GFX_DrawString(0, 40, PointerData->MessageTimePump, WHITE, 0);


	  	  if(i%3 ==0)
	  	  {
	  	  GFX_DrawString(0, 50, PointerData->MessageFreqAlarm, WHITE, 0);
	  	  i=1;
	  	  }

	  	  SSD1306_Display();
	  	  i=i+1;
	  	  printf("TASK OLED \n\r");

	  //		printf("TASK OLED I2C MUTEX is released \n\r");
	        tick2 += (600 * osKernelGetTickFreq()) / 1000;
	  	  osDelayUntil(tick2);
  }
  /* USER CODE END StartTaskSSD1306 */
}

/* USER CODE BEGIN Header_StartTaskPumpON */
/**
* @brief Function implementing the TaskPumpON thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskPumpON */
void StartTaskPumpON(void *argument)
{
  /* USER CODE BEGIN StartTaskPumpON */
	drv8835_init();
  /* Infinite loop */
  for(;;)
  {

	  osThreadFlagsWait(0x00000001U, osFlagsWaitAny, osWaitForever);

	  drv8835_set_motorA_speed(99);
	  osThreadFlagsClear(0x00000001U);
  }
  /* USER CODE END StartTaskPumpON */
}

/* USER CODE BEGIN Header_StartTaskPumpOFF */
/**
* @brief Function implementing the TaskPumpOFF thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskPumpOFF */
void StartTaskPumpOFF(void *argument)
{
  /* USER CODE BEGIN StartTaskPumpOFF */
  /* Infinite loop */
  for(;;)
  {
	  osThreadFlagsWait(0x00000010U, osFlagsWaitAll, osWaitForever);


	  	  drv8835_set_motorA_speed(0);

  }
  /* USER CODE END StartTaskPumpOFF */
}

/* USER CODE BEGIN Header_StartTaskCounterPump */
/**
* @brief Function implementing the TaskCounterPump thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskCounterPump */
void StartTaskCounterPump(void *argument)
{
  /* USER CODE BEGIN StartTaskCounterPump */
	static uint8_t _PumpDipensing = 1;
	uint32_t tick = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  if(HAL_GPIO_ReadPin(B1_GPIO_Port, B1_Pin)== GPIO_PIN_RESET)
	 	  {
	 	  	  _PumpDipensing= _PumpDipensing + 1;
	 	  		if(_PumpDipensing >=60)
	 	  		{
	 	  			_PumpDipensing = 1;
	 	  		}
	 	  		osMessageQueuePut(QueueCounterPumpHandle, &_PumpDipensing , 0, 50);
	 	  }
	 	  else if(HAL_GPIO_ReadPin(B2_GPIO_Port, B2_Pin)== GPIO_PIN_RESET)
	 	  {
	 		  _PumpDipensing= _PumpDipensing -1;
	 		 	  		if(_PumpDipensing <=0)
	 		 	  		{
	 		 	  			_PumpDipensing = 59;
	 		 	  		}
	 		   osMessageQueuePut(QueueCounterPumpHandle, &_PumpDipensing , 0, 50);
	 	  }

	 	  	  	tick += (220 * osKernelGetTickFreq()) / 1000;
	 	  	  	osDelayUntil(tick);
  }
  /* USER CODE END StartTaskCounterPump */
}

/* USER CODE BEGIN Header_StartTaskAlarmCounter */
/**
* @brief Function implementing the TaskAlarmCounte thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskAlarmCounter */
void StartTaskAlarmCounter(void *argument)
{
  /* USER CODE BEGIN StartTaskAlarmCounter */
	static uint8_t _AlarmPeriod = 1;
	uint32_t tick = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  if(HAL_GPIO_ReadPin(B3_GPIO_Port, B3_Pin)== GPIO_PIN_RESET)
	 	 	  {
	 	 	  	  _AlarmPeriod= _AlarmPeriod + 1;
	 	 	  		if(_AlarmPeriod >=16)
	 	 	  		{
	 	 	  			_AlarmPeriod = 1;
	 	 	  		}
	 	 	  		osMessageQueuePut(QueueCounterAlarmHandle, &_AlarmPeriod , 0, 50);
	 	 	  }
	 	 	  else if(HAL_GPIO_ReadPin(B4_GPIO_Port, B4_Pin)== GPIO_PIN_RESET)
	 	 	  {
	 	 		  _AlarmPeriod= _AlarmPeriod - 1;
	 	 		 	  		if(_AlarmPeriod <=0)
	 	 		 	  		{
	 	 		 	  			_AlarmPeriod = 16;
	 	 		 	  		}
	 	 		   osMessageQueuePut(QueueCounterAlarmHandle, &_AlarmPeriod , 0, 50);
	 	 	  }

	 	 	  	  	tick += (200 * osKernelGetTickFreq()) / 1000;
	 	 	  	  	osDelayUntil(tick);
  }
  /* USER CODE END StartTaskAlarmCounter */
}

/* USER CODE BEGIN Header_StartTaskSdCard */
/**
* @brief Function implementing the TaskSdCard thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskSdCard */
void StartTaskSdCard(void *argument)
{
  /* USER CODE BEGIN StartTaskSdCard */

	FRESULT FatFsResult;
	FATFS SdFatFs;
	FIL SdCardFile;

	uint8_t bytes;
	char data[128];

	Data_Structure_t _Data_StructureGet;
	Data_Structure_t *PointerDataZ = &_Data_StructureGet;

