Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
	uint32_t tick = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  	  osMessageQueueGet(QueSDCARDHandle, PointerDataZ, 0, osWaitForever);

//		  osMutexAcquire(TimerSDCardHandle, osWaitForever);


			FatFsResult = f_mount(&SdFatFs, "", 1);
			if(FatFsResult != FR_OK)
			  {
				  bytes = sprintf(data, "FatFS mount error.\n\r");
				  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);
			  }

			  else
			  {
				  bytes = sprintf(data, "FatFS mounted.\n\r");
				  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);

				  //
				  // Open file on SD for writing
				  //
				  osMutexAcquire(MutexSdCardHandle, osWaitForever);
				  FatFsResult = f_open(&SdCardFile, "badaniam.csv", FA_WRITE|FA_OPEN_APPEND);

				  //
				  // File open error check
				  //
				  if(FatFsResult != FR_OK)
				  {
					  bytes = sprintf(data, "No badaniam.csv file. Can't create.\n\r");
					  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);
				  }


				  else
				  {

					  bytes = sprintf(data, "File opened.\n\r");
					  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);

					  //
					  //	Print something to this file
					  //
					  f_printf(&SdCardFile,PointerDataZ->MessageData);
					  f_printf(&SdCardFile,PointerDataZ->MessageTime);
					  f_printf(&SdCardFile, PointerDataZ->MessageTemp);
					  f_printf(&SdCardFile,PointerDataZ->MessageHum);
					  f_printf(&SdCardFile,PointerDataZ->MessageInten);
					  f_printf(&SdCardFile,PointerDataZ->MessagePvVoltageBus);
					  f_printf(&SdCardFile,PointerDataZ->MessagePVVoltageShunt);
					  f_printf(&SdCardFile,PointerDataZ->MessagePVCurrent);
					  f_printf(&SdCardFile,PointerDataZ->MessageTimePump);
					  f_printf(&SdCardFile,PointerDataZ->MessageFreqAlarm);
					  f_printf(&SdCardFile,"\n");




		  //  		  for(uint8_t i = 0; i < 10; i++)
		  //  		  {
		  //  			  f_printf(&SdCardFile, "Line number %d;", i);
		  //  		  }

					  //
					  // Close file
					  //
					  FatFsResult = f_close(&SdCardFile);

					  bytes = sprintf(data, "File closed!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.\n\r");
					  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);


					 //
							  // Open file on SD for reading
							  //
//					  FatFsResult = f_open(&SdCardFile, "badaniaFreertos.csv", FA_READ);
//					  if(FatFsResult != FR_OK)
//				  {
//						  bytes = sprintf(data, "No badaniaFreertos.csv file. Can't create.\n\r");
//						HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);
//				  }
//					else
//						{
//						UINT len;
//
//							do
//							{
//								len=0;
//								f_read(&SdCardFile, data,10,&len);
//								HAL_UART_Transmit(&huart2, (uint8_t*)data, len, 1000);
//							} while (len >0);
//
//						  FatFsResult = f_close(&SdCardFile);
//						  bytes = sprintf(data, "File closed.\n\r");
//						  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);
//						}





	      }

				  osMutexRelease(MutexSdCardHandle);
			  }
//			 osMutexRelease(MutexSdCardHandle);
			tick += (5000 * osKernelGetTickFreq()) / 1000;
				  	 	 	  	  	osDelayUntil(tick);
  }
  /* USER CODE END StartTaskSdCard */
}

/* USER CODE BEGIN Header_StartTaskINA219 */
/**
* @brief Function implementing the TaskINA219 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskINA219 */
void StartTaskINA219(void *argument)
{
  /* USER CODE BEGIN StartTaskINA219 */

	INA219_t ina219;
	ina219_calibration ina219_calibration;
	ina219_calibration.ina219_calibrationValue = 4096;
	ina219_calibration.ina219_currentDivider_mA = 10; // Current LSB = 100uA per bit (1000/100 = 10)
	ina219_calibration.ina219_powerMultiplier_mW = 2; // Power LSB = 1mW per bit (2/1)
	INA219Data_t _ina219;
	INA219Data_t *INA_219_pointer = &_ina219;





	 osMutexAcquire(MutexI2CHandle, osWaitForever);
	 INA219_Init(&ina219, &hi2c1, INA219_ADDRESS,&ina219_calibration);
	 osMutexRelease(MutexI2CHandle);
	osTimerStart(TimerINA219Handle, 300);
	uint32_t tick = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {


	  	  osMutexAcquire(MutexI2CHandle, osWaitForever);
	  	  printf("INA219 Mutex Acquire\n\r");
		  INA_219_pointer->VoltageBus = INA219_ReadBusVoltage(&ina219);
		  INA_219_pointer->VoltageShunt = INA219_ReadShuntVolage(&ina219);
		  INA_219_pointer->Current = INA219_ReadCurrent(&ina219,&ina219_calibration);
////
		  osMutexRelease(MutexI2CHandle);
		  printf("INA219 Mutex Released\n\r");
//
		  if (osOK == osSemaphoreAcquire(BinarySemINA219Handle, 0)) {
		  	 	  			osMessageQueuePut(QuequePVHandle, &_ina219, 0, osWaitForever);
		  	 	  		}
		  printf("INA219 exit \n\r");
//


	  tick+=(265*osKernelGetTickFreq())/1000;
	  osDelayUntil(tick);
  }
  /* USER CODE END StartTaskINA219 */
}

/* CallbackTimerBmeData function */
void CallbackTimerBmeData(void *argument)
{
  /* USER CODE BEGIN CallbackTimerBmeData */
	osSemaphoreRelease(BinarySemBme280Handle);
  /* USER CODE END CallbackTimerBmeData */
}

/* CallbackTimerBh1750Data function */
void CallbackTimerBh1750Data(void *argument)
{
  /* USER CODE BEGIN CallbackTimerBh1750Data */
	osSemaphoreRelease(BinarySemBH1750Handle);
  /* USER CODE END CallbackTimerBh1750Data */
}

/* CallbackTimerRTC function */
void CallbackTimerRTC(void *argument)
{
  /* USER CODE BEGIN CallbackTimerRTC */
	osSemaphoreRelease(BinarySemRTCHandle);
  /* USER CODE END CallbackTimerRTC */
}

/* CallbackTimerSDCard function */
void CallbackTimerSDCard(void *argument)
{
  /* USER CODE BEGIN CallbackTimerSDCard */
	osSemaphoreRelease(BinarySdCardHandle);
  /* USER CODE END CallbackTimerSDCard */
}

/* CallbackTimerINA219 function */
void CallbackTimerINA219(void *argument)
{
  /* USER CODE BEGIN CallbackTimerINA219 */
	osSemaphoreRelease(BinarySemINA219Handle);
  /* USER CODE END CallbackTimerINA219 */
}

/* Private application code --------------------------------------------------*/
/* USER CODE BEGIN Application */

//void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
//{
//	static uint8_t _PumpDipensing = 1;
//
//
//
//	if(GPIO_Pin == B1_Pin)
//	{
//
//		_PumpDipensing= _PumpDipensing + 1;
//		if(_PumpDipensing >=60)
//		{
//			_PumpDipensing = 1;
//		}
//		osMessageQueuePut(QueueCounterPumpHandle, &_PumpDipensing , 0, 0);
//
//
//
////		osThreadFlagsSet(TaskAlarmCountUHandle, 0x00010000U);
//
//	}
//
//}
//void Parse(void)
//{
//	uint8_t i,j;
//	float EnvParameters[5];
//	char Message[200];
//
//	for ( i = 0; i < 5; i++)
//	{
//		char *ParsePointer = strtok(NULL,",");
//	}
//}

void _putchar(char character) {
	// send char to console etc.
	osMutexAcquire(MutexPrintfHandle, osWaitForever);
	HAL_UART_Transmit(&huart2, (uint8_t*)&character, 1, 1000);

	osMutexRelease(MutexPrintfHandle);
}

/* USER CODE END Application */

